/**
 * Created by alic(AlicFeng) on 17-7-30 from CLion.
 * Email is alic@samego.com
 */
//C语言的位运算
/**
 1 与    &
 2 异    |
 3 异或   ^
 4 取反   ~
 5 左移   <<
 6 右移   >>
 */

#include <stdio.h>

int main() {
    /*位运算之与运算*/
    int x = 4;      // 0000000 00000000 00000000 00000100
    int y = 7;      // 0000000 00000000 00000000 00000111
    int a = x & y;  // 0000000 00000000 00000000 00000100
    printf("%d&%d=%d\n", x, y, a);

    /*位运算之或运算*/
    x = 4;          // 0000000 00000000 00000000 00000100
    y = 7;          // 0000000 00000000 00000000 00000111
    int b = x | y;  // 0000000 00000000 00000000 00000111
    printf("%d|%d=%d\n", x, y, b);

    /*位运算之异或运算*/
    x = 4;          // 0000000 00000000 00000000 00000100
    y = 7;          // 0000000 00000000 00000000 00000111
    int c = x ^y;   // 0000000 00000000 00000000 00000011
    printf("%d^%d=%d\n", x, y, c);

    /*位运算之取反运算*/
    x = 4;          // 0000000 00000000 00000000 00000100
    int d = ~x;     // 0000000 00000000 00000000 00000011
    printf("~%d=%d\n", x, d);

    /*位运算之左移运算*/
    /*value * pow(offset,2);*/
    x = 3;          // 0000000 00000000 00000000 00000011
    int e = x << 4; // 3*4*4
    printf("%d<<4=%d\n", x, e);

    /*位运算之右移运算*/
    /*value / pow(offset,2);*/
    x = 64;          // 0000000 00000000 00000000 00000011
    int f = x >> 4; // 64*4*4
    printf("%d>>4=%d\n", x, f);

    return 0;
}



